org/bible/2_John.org
#+title: 2 John
#+HTML: <h1> The Second Letter of <br> J O H N </h1>
#+setupfile: ../static/setup/bible.setup

** 2 John 1

*** A Greeting from the Elder ([[file:3_998.htm][3 John 1:1--4]])
[[html-class:drop][1]]
<<1:1>> The elder,

To the chosen lady and her children, whom I love in the truth---and not I alone, but also all who know the truth--- 
<<1:2>> *2* because of the truth that abides in us and will be with us forever:

<<1:3>> *3* Grace, mercy, and peace from God the Father and from Jesus Christ, the Son of the Father, will be with us in truth and love.

*** Walking in the Truth (John 8:30--47)

<<1:4>> *4* I was overjoyed to find some of your children walking in the truth, just as the Father has commanded us. 
<<1:5>> *5* And now I urge you, dear lady---not as a new commandment to you, but one we have had from the beginning---that we love one another. 
<<1:6>> *6* And this is love, that we walk according to His commandments. This is the very commandment you have heard from the beginning, that you must walk in love.

*** Beware of Deceivers

<<1:7>> *7* For many deceivers have gone out into the world, refusing to confess the coming of Jesus Christ in the flesh. Any such person is the deceiver and the antichrist. 
<<1:8>> *8* Watch yourselves, so that you do not lose what we have worked for, but that you may be fully rewarded. 
<<1:9>> *9* Anyone who runs ahead without remaining in the teaching of Christ does not have God. Whoever remains in His teaching has both the Father and the Son.

<<1:10>> *10* If anyone comes to you but does not bring this teaching, do not receive him into your home or even greet him. 
<<1:11>> *11* Whoever greets such a person shares in his evil deeds.

*** Conclusion ([[file:3_998.htm#13][3 John 1:13--14]])

<<1:12>> *12* I have many things to write to you, but I would prefer not to do so with paper and ink. Instead, I hope to come and speak with you face to face, so that our joy may be complete.

<<1:13>> *13* The children of your elect sister send you greetings.

