public/bible/2_John.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-03 Mon 15:41 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2 John</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../static/css/bible.css"/>
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">2 John</h1>
</header><h1> The Second Letter of <br> J O H N </h1>
<div id="outline-container-orgf35c1ca" class="outline-2">
<h2 id="orgf35c1ca">2 John 1</h2>
<div class="outline-text-2" id="text-orgf35c1ca">
</div>
<div id="outline-container-org98ae283" class="outline-3">
<h3 id="org98ae283">A Greeting from the Elder (<a href="3_998.htm">3 John 1:1&#x2013;4</a>)</h3>
<div class="outline-text-3" id="text-org98ae283">
<p>
<span class="drop">1</span>
<a id="1-1"></a> The elder,
</p>

<p>
To the chosen lady and her children, whom I love in the truth&#x2014;and not I alone, but also all who know the truth&#x2014; 
<a id="1-2"></a> <b>2</b> because of the truth that abides in us and will be with us forever:
</p>

<p>
<a id="1-3"></a> <b>3</b> Grace, mercy, and peace from God the Father and from Jesus Christ, the Son of the Father, will be with us in truth and love.
</p>
</div>
</div>
<div id="outline-container-org1499235" class="outline-3">
<h3 id="org1499235">Walking in the Truth (John 8:30&#x2013;47)</h3>
<div class="outline-text-3" id="text-org1499235">
<p>
<a id="1-4"></a> <b>4</b> I was overjoyed to find some of your children walking in the truth, just as the Father has commanded us. 
<a id="1-5"></a> <b>5</b> And now I urge you, dear lady&#x2014;not as a new commandment to you, but one we have had from the beginning&#x2014;that we love one another. 
<a id="1-6"></a> <b>6</b> And this is love, that we walk according to His commandments. This is the very commandment you have heard from the beginning, that you must walk in love.
</p>
</div>
</div>
<div id="outline-container-org36be353" class="outline-3">
<h3 id="org36be353">Beware of Deceivers</h3>
<div class="outline-text-3" id="text-org36be353">
<p>
<a id="1-7"></a> <b>7</b> For many deceivers have gone out into the world, refusing to confess the coming of Jesus Christ in the flesh. Any such person is the deceiver and the antichrist. 
<a id="1-8"></a> <b>8</b> Watch yourselves, so that you do not lose what we have worked for, but that you may be fully rewarded. 
<a id="1-9"></a> <b>9</b> Anyone who runs ahead without remaining in the teaching of Christ does not have God. Whoever remains in His teaching has both the Father and the Son.
</p>

<p>
<a id="1-10"></a> <b>10</b> If anyone comes to you but does not bring this teaching, do not receive him into your home or even greet him. 
<a id="1-11"></a> <b>11</b> Whoever greets such a person shares in his evil deeds.
</p>
</div>
</div>
<div id="outline-container-org36e5c14" class="outline-3">
<h3 id="org36e5c14">Conclusion (<a href="3_998.htm#13">3 John 1:13&#x2013;14</a>)</h3>
<div class="outline-text-3" id="text-org36e5c14">
<p>
<a id="1-12"></a> <b>12</b> I have many things to write to you, but I would prefer not to do so with paper and ink. Instead, I hope to come and speak with you face to face, so that our joy may be complete.
</p>

<p>
<a id="1-13"></a> <b>13</b> The children of your elect sister send you greetings.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
